{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.9", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 3, 3, 1], "name": "input_batch", "sparse": false}, "inbound_nodes": [], "name": "input_batch"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10", "data_format": "channels_last"}, "inbound_nodes": [[["input_batch", 0, 0, {}]]], "name": "flatten_10"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "name": "dense_19"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "dense_20"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "activation_10"}], "input_layers": [["input_batch", 0, 0]], "output_layers": [["activation_10", 0, 0]], "name": "model_10"}}, "training_config": {"metrics": [], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.009999999776482582, "rho": 0.8999999761581421, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_19/kernel", "shape": [9, 16], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [16, 9], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [9], "dtype": "float32"}]}]}