{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_9/kernel", "shape": [9, 12], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [12], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [12, 9], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [9], "dtype": "float32"}]}]}